In [1]:
%matplotlib inline
import pandas as pd

In [2]:
titles = pd.read_csv('C:/Users/ManiShankar/Documents/LetsUpgrade/AI_ML/Assignments/Day_16&17/titles.csv')
cast = pd.read_csv('C:/Users/ManiShankar/Documents/LetsUpgrade/AI_ML/Assignments/Day_16&17/cast.csv')
release_dates = pd.read_csv('C:/Users/ManiShankar/Documents/LetsUpgrade/AI_ML/Assignments/Day_16&17/release_dates.csv')
titles.head()

                  title  year
0    Tasveer Mere Sanam  1996
1              Only You  1994
2  El pueblo del terror  1970
3               Machine  2007
4                  MARy  2008

In [3]:
cast.head(2)

             title  year      name   type character     n
0   Closet Monster  2015  Buffy #1  actor   Buffy 4  31.0
1  Suuri illusioni  1985    Homo $  actor    Guests  22.0

In [4]:
release_dates.head(2)

                   title  year   country        date
0  #73, Shaanthi Nivaasa  2007     India  15/06/2007
1                  #BKKY  2016  Cambodia  12/10/2017

### How many movies are listed in the titles dataframe?

In [5]:
titles.shape[0]

244914

### What are the earliest two films listed in the titles dataframe?

In [6]:
titles.sort_values(by=['year']).head(2)

                     title  year
193222          Miss Jerry  1894
51388   The Startled Lover  1898

### How many movies have the title "Hamlet"?

In [7]:
len(titles[titles.title == 'Hamlet'])

20

### How many movies are titled "North by Northwest"?

In [8]:
len(titles[titles.title == 'North by Northwest'])

1

### When was the first movie titled "Hamlet" made?

In [9]:
titles[titles.title == 'Hamlet'].sort_values(by='year').head(1)

        title  year
52521  Hamlet  1910

### List all of the "Treasure Island" movies from earliest to most recent.

In [10]:
titles[titles.title == 'Treasure Island'].sort_values(by='year')

                  title  year
55686   Treasure Island  1918
196514  Treasure Island  1920
141822  Treasure Island  1934
77354   Treasure Island  1950
65051   Treasure Island  1972
37238   Treasure Island  1973
173051  Treasure Island  1985
27076   Treasure Island  1999

### How many movies were made in the year 1950?

In [11]:
len(titles[titles.year == 1950])

1113

### How many movies were made in the year 1960?

In [12]:
len(titles[titles.year == 1960])

1549

### How many movies were made from 1950 through 1959?

In [13]:
len(titles[(titles.year >= 1950) & (titles.year <= 1959)])

12934

### In what years has a movie titled "Batman" been released?

In [14]:
titles[titles.title == 'Batman']

         title  year
39349   Batman  1943
240896  Batman  1989

### How many roles were there in the movie "Inception"?

In [15]:
cast.head(1)

            title  year      name   type character     n
0  Closet Monster  2015  Buffy #1  actor   Buffy 4  31.0

In [16]:
len(cast[cast['title']==('Inception')])

28

### How many roles in the movie "Inception" are NOT ranked by an "n" value?

In [17]:
cast[cast['title'] == 'Inception'].head(2)

,title,year,name,type,character,n
98153,Inception,2010,Michael (III) August,actor,LAX Passenger,NaN
149008,Inception,2010,Peter Basham,actor,Fischer's Jet Captain,44.0

In [18]:
cast[cast['title'] == 'Inception'].n.isna().sum()

9

### But how many roles in the movie "Inception" did receive an "n" value?

In [19]:
len(cast[(cast['title'] == 'Inception')&(cast['n'].isnull() == False)])

19

In [20]:
cast[(cast['title'] == 'Inception')&(cast['n'].isnull() == False)]

,title,year,name,type,character,n
149008,Inception,2010,Peter Basham,actor,Fischer's Jet Captain,44.0
183937,Inception,2010,Tom Berenger,actor,Browning,8.0
260128,Inception,2010,Virgile Bramly,actor,Bridge Sub Con,29.0
326745,Inception,2010,Michael Caine,actor,Miles,11.0
333415,Inception,2010,Earl Cameron,actor,Elderly Bald Man,20.0
433867,Inception,2010,Nicolas Clerc,actor,Bridge Sub Con,26.0
444385,Inception,2010,Adam (IV) Cole,actor,Bar Sub Con,34.0
517227,Inception,2010,Jean-Michel Dagory,actor,Bridge Sub Con,30.0
590576,Inception,2010,Leonardo DiCaprio,actor,Cobb,1.0
709436,Inception,2010,Russ Fega,actor,Cab Driver,23.0
737322,Inception,2010,Mark Fleischmann,actor,Penrose Sub Con,32.0
807795,Inception,2010,Michael Gaston,actor,Immigration Officer,45.0
812135,Inception,2010,Johnathan Geare,actor,James (3 years),17.0
832083,Inception,2010,Carl Gilliard,actor,Lobby Sub Con,40.0
833376,Inception,2010,Jack Gilroy,actor,Old Cobb,50.0
859993,Inception,2010,Joseph Gordon-Levitt,actor,Arthur,2.0
910757,Inception,2010,Lukas Haas,actor,Nash,12.0
940923,Inception,2010,Tom Hardy,actor,Eames,4.0
967176,Inception,2010,Ryan Hayward,actor,Lawyer,21.0

### Display the cast of "North by Northwest" in their correct "n"-value order, ignoring roles that did not earn a numeric "n" value.

In [21]:
cast[cast['title'] == 'North by Northwest'].isna().sum()

title         0
year          0
name          0
type          0
character     0
n            35
dtype: int64

In [22]:
cast[cast['title'] == 'North by Northwest'].dropna().sort_values(by='n')

,title,year,name,type,character,n
871426,North by Northwest,1959,Cary Grant,actor,Roger O. Thornhill,1.0
356707,North by Northwest,1959,Leo G. Carroll,actor,The Professor,5.0
665768,North by Northwest,1959,Robert Ellenstein,actor,Licht,11.0
464736,North by Northwest,1959,Philip Coolidge,actor,Dr. Cross,13.0
206471,North by Northwest,1959,Edward Binns,actor,Captain Junket,15.0

### Display the entire cast, in "n"-order, of the 1972 film "Sleuth".

In [23]:
titles[titles.title == 'Sleuth']

         title  year
79273   Sleuth  1972
205128  Sleuth  2007

In [24]:
cast[cast.title == 'Sleuth']

         title  year                 name   type          character    n
260242  Sleuth  2007      Kenneth Branagh  actor  Other Man on T.V.  NaN
326773  Sleuth  1972        Michael Caine  actor        Milo Tindle  2.0
326774  Sleuth  2007        Michael Caine  actor             Andrew  1.0
373876  Sleuth  1972       Alec Cawthorne  actor  Inspector Doppler  3.0
373877  Sleuth  2007  Alec (II) Cawthorne  actor  Inspector Doppler  NaN

In [25]:
cast[(cast['title'] == 'Sleuth')&(cast['year'] == 1972)].sort_values(by = 'n')

         title  year            name   type          character    n
326773  Sleuth  1972   Michael Caine  actor        Milo Tindle  2.0
373876  Sleuth  1972  Alec Cawthorne  actor  Inspector Doppler  3.0

### Now display the entire cast, in "n"-order, of the 2007 version of "Sleuth".

In [26]:
cast[(cast['title'] == 'Sleuth')&(cast['year'] == 2007)].sort_values(by = 'n')

         title  year                 name   type          character    n
326774  Sleuth  2007        Michael Caine  actor             Andrew  1.0
260242  Sleuth  2007      Kenneth Branagh  actor  Other Man on T.V.  NaN
373877  Sleuth  2007  Alec (II) Cawthorne  actor  Inspector Doppler  NaN

### How many roles were credited in the silent 1921 version of Hamlet?

In [27]:
titles[titles.title == 'Hamlet'].sort_values(by = 'year').head(5)

         title  year
52521   Hamlet  1910
198234  Hamlet  1911
39916   Hamlet  1913
10637   Hamlet  1921
101728  Hamlet  1948

In [28]:
cast[(cast['title'] == 'Hamlet') & (cast['year'] == 1921)]

         title  year              name   type     character    n
7789    Hamlet  1921  Fritz Achterberg  actor   Fortinbras,  9.0
458904  Hamlet  1921      Paul Conradi  actor  K?nig Hamlet  2.0
555034  Hamlet  1921  Anton De Verdier  actor       Laertes  7.0

In [29]:
len(cast[(cast['title'] == 'Hamlet') & (cast['year'] == 1921)])

3

### How many roles were credited in Branaghs 1996 Hamlet?

In [30]:
cast[(cast['title'] == 'Hamlet') & (cast['year'] == 1996)]

,title,year,name,type,character,n
1731,Hamlet,1996,Riz Abbasi,actor,Attendant to Claudius,1.0
95861,Hamlet,1996,Richard Attenborough,actor,English Ambassador,2.0
158642,Hamlet,1996,Simon Russell Beale,actor,Second Gravedigger,37.0
214473,Hamlet,1996,David (V) Blair,actor,Attendant to Claudius,3.0
219554,Hamlet,1996,Brian Blessed,actor,Ghost of Hamlet's Father,4.0
250773,Hamlet,1996,Christopher Bowles,actor,Cadet in Play,NaN
260225,Hamlet,1996,Kenneth Branagh,actor,Hamlet,5.0
272749,Hamlet,1996,Richard Briers,actor,Polonius,6.0
294652,Hamlet,1996,Michael Bryant,actor,Priest,7.0
319501,Hamlet,1996,Peter Bygott,actor,Attendant to Claudius,8.0
344365,Hamlet,1996,Kenneth W Caravan,actor,Laertes Mob,NaN
500916,Hamlet,1996,Billy Crystal,actor,First Gravedigger,10.0
518572,Hamlet,1996,Charles Daish,actor,Stage Manager,11.0
576147,Hamlet,1996,G?rard Depardieu,actor,Reynaldo,13.0
598618,Hamlet,1996,Reece Dinsdale,actor,Guildenstern,14.0
604339,Hamlet,1996,Ken Dodd,actor,Yorick,15.0
656817,Hamlet,1996,Rob Edwards,actor,Lucianus,17.0
669232,Hamlet,1996,Jimmy Ellis,actor,Old Fortinbras,NaN
704270,Hamlet,1996,Nicholas Farrell,actor,Horatio,18.0
708468,Hamlet,1996,Ray Fearon,actor,Francisco,19.0
827066,Hamlet,1996,John Gielgud,actor,Priam,21.0
990819,Hamlet,1996,Charlton Heston,actor,Player King,23.0

In [31]:
len(cast[(cast['title'] == 'Hamlet') & (cast['year'] == 1996)])

22

### How many "Hamlet" roles have been listed in all film credits through history?

In [32]:
len(cast[cast.title == 'Hamlet'])

117

### How many people have played an "Ophelia"?

In [33]:
len(cast[cast.title == 'Ophelia'])

4

### How many people have played a role called "The Dude"?

In [34]:
len(cast[cast.title == 'The Dude'])

0

In [35]:
titles[titles.title == 'The Dude']

Empty DataFrame
Columns: [title, year]
Index: []

### How many people have played a role called "The Stranger"?

In [36]:
len(cast[cast.title == 'The Stranger'])

27

### How many roles has Sidney Poitier played throughout his career?

In [37]:
len(cast[cast.name == 'Sidney Poitier'])

0

### How many roles has Judi Dench played?

In [38]:
len(cast[cast.name == 'Judi Dench'])

0

### List the supporting roles (having n=2) played by Cary Grant in the 1940s, in order by year.

In [39]:
temp = cast[cast.name == 'Cary Grant']
temp.count()

title        79
year         79
name         79
type         79
character    79
n            73
dtype: int64

In [40]:
len(temp[temp.n == 2])

20

### List the leading roles that Cary Grant played in the 1940s in order by year.

In [41]:
cast[cast.name == 'Cary Grant'].sort_values(by='year')

,title,year,name,type,character,n
871419,Merrily We Go to Hell,1932,Cary Grant,actor,Charlie Baxter,9.0
871418,Madame Butterfly,1932,Cary Grant,actor,Lieutenant B.F. Pinkerton,2.0
871392,Blonde Venus,1932,Cary Grant,actor,Nick Townsend,3.0
871437,Sinners in the Sun,1932,Cary Grant,actor,Ridgeway,8.0
871409,Hot Saturday,1932,Cary Grant,actor,Romer Sheffield,1.0
...,...,...,...,...,...,...
871462,Walk Don't Run,1966,Cary Grant,actor,Sir William Rutland,1.0
871456,This Is Elvis,1981,Cary Grant,actor,Himself,NaN
871397,Dead Men Don't Wear Plaid,1982,Cary Grant,actor,'Handsome' (in 'Suspicion'),10.0
871428,Nuovo Cinema Paradiso,1988,Cary Grant,actor,Walter Burns,NaN
871461,Trumbo,2015,Cary Grant,actor,Himself,NaN

### How many roles were available for actors in the 1950s?

In [42]:
print(cast.isna().sum())
len(cast[cast.year == 1950])

title             0
year              0
name              0
type              0
character         0
n            410339
dtype: int64

7289

### How many roles were available for actresses in the 1950s?

In [43]:
cast[cast.type == 'actresses']
len(cast[cast.type == 'actresses'])

0

In [44]:
cast['type'].value_counts()

actor    1048575
Name: type, dtype: int64

### How many leading roles (n=1) were available from the beginning of film history through 1980?

In [45]:
len(cast[(cast.year == 1980) & (cast['n'] == 1)])

311

### How many non-leading roles were available through from the beginning of film history through 1980?

In [46]:
print("Total roles:",len(cast[cast.year >= 1980]))
print("Non-leading roles:",len(cast[(cast.year >= 1980) & (cast['n'] > 1)]))

Total roles: 690449
Non-leading roles: 402528

### How many roles through 1980 were minor enough that they did not warrant a numeric "n" rank?

In [47]:
len(cast[(cast.year >= 1980) & (cast['n'].isna()==True)])

262864